RepXcel/nRF52832-Embedded-Application/src/main.c
    /* Error checking */
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module. */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void on_workout_data_evt(ble_workout_data_t * p_workout_data_service, ble_workout_data_evt_t * p_evt)
{
    ret_code_t err_code;
    switch(p_evt->evt_type)
    {
        case BLE_WORKOUT_DATA_EVT_NOTIFICATION_ENABLED:
            if (pdPASS != xTimerStart(ble_notif_timer_handle, OSTIMER_WAIT_FOR_QUEUE))
                {
                    APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
                }
            break;

        case BLE_WORKOUT_DATA_EVT_NOTIFICATION_DISABLED:
            //err_code = app_timer_stop(m_notification_timer_id);
            //APP_ERROR_CHECK(err_code);
            break;

        case BLE_WORKOUT_DATA_EVT_CONNECTED:
            break;

        case BLE_WORKOUT_DATA_EVT_DISCONNECTED:
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_hrs_init_t     hrs_init;
    ble_bas_init_t     bas_init;
    ble_dis_init_t     dis_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    uint8_t            body_sensor_location;

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Heart Rate Service.
    // body_sensor_location = BLE_HRS_BODY_SENSOR_LOCATION_FINGER;

    // memset(&hrs_init, 0, sizeof(hrs_init));

    // hrs_init.evt_handler                 = NULL;
    // hrs_init.is_sensor_contact_supported = true;
    // hrs_init.p_body_sensor_location      = &body_sensor_location;

    // Here the sec level for the Heart Rate Service can be changed/increased.
    // hrs_init.hrm_cccd_wr_sec = SEC_OPEN;
    // hrs_init.bsl_rd_sec      = SEC_OPEN;

    // err_code = ble_hrs_init(&m_hrs, &hrs_init);
    // APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    // memset(&bas_init, 0, sizeof(bas_init));

    // // Here the sec level for the Battery Service can be changed/increased.
    // bas_init.bl_rd_sec        = SEC_OPEN;
    // bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    // bas_init.bl_report_rd_sec = SEC_OPEN;

    // bas_init.evt_handler          = NULL;
    // bas_init.support_notification = true;
    // bas_init.p_report_ref         = NULL;
    // bas_init.initial_batt_level   = 100;

    // err_code = ble_bas_init(&m_bas, &bas_init);
    // APP_ERROR_CHECK(err_code);

    // // Initialize Device Information Service.
    // memset(&dis_init, 0, sizeof(dis_init));

    // ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

    // dis_init.dis_char_rd_sec = SEC_OPEN;

    // err_code = ble_dis_init(&dis_init);
    // APP_ERROR_CHECK(err_code);

    ble_workout_data_init_t            workout_data_init;

    // Initialize workout data Service init structure to zero.
    memset(&workout_data_init, 0, sizeof(workout_data_init));
    
    workout_data_init.evt_handler                = on_workout_data_evt;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&workout_data_init.custom_value_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&workout_data_init.custom_value_char_attr_md.write_perm);

    err_code = ble_workout_data_init(&m_workout_data, &workout_data_init);
    APP_ERROR_CHECK(err_code);	
}


/**@brief Function for initializing the sensor simulators. */
static void sensor_simulator_init(void)
{
    m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
    m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
    m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
    m_battery_sim_cfg.start_at_max = true;

    sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);

    m_heart_rate_sim_cfg.min          = MIN_HEART_RATE;
    m_heart_rate_sim_cfg.max          = MAX_HEART_RATE;
    m_heart_rate_sim_cfg.incr         = HEART_RATE_INCREMENT;
    m_heart_rate_sim_cfg.start_at_max = false;

    sensorsim_init(&m_heart_rate_sim_state, &m_heart_rate_sim_cfg);

    m_rr_interval_sim_cfg.min          = MIN_RR_INTERVAL;
    m_rr_interval_sim_cfg.max          = MAX_RR_INTERVAL;
    m_rr_interval_sim_cfg.incr         = RR_INTERVAL_INCREMENT;
    m_rr_interval_sim_cfg.start_at_max = false;

    sensorsim_init(&m_rr_interval_sim_state, &m_rr_interval_sim_cfg);
}


/**@brief   Function for starting application timers.
 * @details Timers are run after the scheduler has started.
 */
static void application_timers_start(void)
{
    // Start application timers.
    // if (pdPASS != xTimerStart(m_battery_timer, OSTIMER_WAIT_FOR_QUEUE))
    // {
    //     APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    // }
    // if (pdPASS != xTimerStart(m_heart_rate_timer, OSTIMER_WAIT_FOR_QUEUE))
    // {
    //     APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    // }
    // if (pdPASS != xTimerStart(m_rr_interval_timer, OSTIMER_WAIT_FOR_QUEUE))
    // {
    //     APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    // }
    // if (pdPASS != xTimerStart(m_sensor_contact_timer, OSTIMER_WAIT_FOR_QUEUE))
    // {
    //     APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    // }
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

