RepXcel/nRF52832-Embedded-Application/src/main.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality. */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_SHORT_NAME;
    init.advdata.short_name_len          = 3;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for starting advertising. */
static void advertising_start(void * p_erase_bonds)
{
    bool erase_bonds = *(bool*)p_erase_bonds;

    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


#if NRF_LOG_ENABLED
/**@brief Thread for handling the logger.
 *
 * @details This thread is responsible for processing log entries if logs are deferred.
 *          Thread flushes all log entries and suspends. It is resumed by idle task hook.
 *
 * @param[in]   arg   Pointer used for passing some arbitrary information (context) from the
 *                    osThreadCreate() call to the thread.
 */
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif //NRF_LOG_ENABLED

#if NRF_LOG_ENABLED && NRF_LOG_DEFERRED
 void log_pending_hook( void )
 {
     BaseType_t result = pdFAIL;

    if ( __get_IPSR() != 0 )
    {
        BaseType_t higherPriorityTaskWoken = pdFALSE;
        result = xTaskNotifyFromISR( m_logger_thread, 0, eSetValueWithoutOverwrite, &higherPriorityTaskWoken );

        if ( pdFAIL != result )
        {
        portYIELD_FROM_ISR( higherPriorityTaskWoken );
        }
    }
    else
    {
        UNUSED_RETURN_VALUE(xTaskNotify( m_logger_thread, 0, eSetValueWithoutOverwrite ));
    }
 }
#endif

/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Initialize LIS2DH12 instance
 */
static void accel_init(void)
{
    ret_code_t err_code;

    nrf_drv_twi_config_t const config = {
       .scl                = SCL,
       .sda                = SDA,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_LOWEST,
       .clear_bus_init     = false
    };

    err_code = nrf_twi_mngr_init(&m_nrf_twi_mngr, &config);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_twi_sensor_init(&m_nrf_twi_sensor);
    APP_ERROR_CHECK(err_code);
    err_code = lis2dh12_init(&m_lis2dh12);
    APP_ERROR_CHECK(err_code);
}

static void int1_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    m_data_ready = true;
    nrf_gpio_pin_clear(OUT_LED);
}

static void gpio_init(void){
	ret_code_t err_code;

	err_code = nrf_drv_gpiote_init();
	APP_ERROR_CHECK(err_code);

    nrf_gpio_cfg_output(CS);
    nrf_gpio_pin_set(CS);

    nrf_gpio_cfg_output(OUT_LED);

    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
	err_code = nrf_drv_gpiote_in_init(INT1, &in_config, int1_pin_handler);
	APP_ERROR_CHECK(err_code);
	nrf_drv_gpiote_in_event_enable(INT1, true);
}

static void acceleration_to_velocity(lis2dh12_data_t* m_accel_data, float* m_velocity, uint8_t samples){
    uint8_t samples_to_read = 0;
    for (uint8_t i = 0; i < samples; i++){
        int16_t accel_x_mg = m_accel_data[i].x >> 4;
        int16_t accel_y_mg = m_accel_data[i].y >> 4;
        int16_t accel_z_mg = m_accel_data[i].z >> 4;
        float accel_magnitude_mg = sqrt(accel_x_mg * accel_x_mg + accel_y_mg * accel_y_mg + accel_z_mg * accel_z_mg);
        float accel_magnitude_cmpss = MG_TO_CMPS(accel_magnitude_mg);
        if (accel_magnitude_cmpss > ACCEL_ERROR_THRESHOLD){
            samples_to_read = 3;
        }
        if(samples_to_read){
            *m_velocity += accel_magnitude_cmpss * ACCEL_PERIOD;
        } else {
            *m_velocity = 0;
            samples_to_read = MAX(samples_to_read - 1, 0);
        }
        // NRF_LOG_INFO("i:%d %d %d %d", i, accel_x_mg, accel_y_mg, accel_z_mg);
        // NRF_LOG_INFO("Accel magnitude (mg): " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_mg));
        // NRF_LOG_INFO("Accel magnitude (cm/s): " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_cmpss));
        NRF_LOG_INFO("Velocity: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(*m_velocity));
    }
}

static void accel_thread(void * arg)
{
    UNUSED_PARAMETER(arg);
    ret_code_t err_code;

    LIS2DH12_DATA_CFG(m_lis2dh12, LIS2DH12_ODR_200HZ, false, true, true, true, LIS2DH12_SCALE_2G, true);
    LIS2DH12_FIFO_CFG(m_lis2dh12, true, LIS2DH12_STREAM, false, ACCEl_BUFFER_SIZE);
    LIS2DH12_INT1_PIN_CFG(m_lis2dh12, false, false, false, false, true, false, true, false);
    LIS2DH12_FILTER_CFG(m_lis2dh12, LIS2DH12_FILTER_MODE_NORMAL, LIS2DH12_FILTER_FREQ_1, true, false, false, false);
    
    err_code = lis2dh12_cfg_commit(&m_lis2dh12);
    
    APP_ERROR_CHECK(err_code);
    
    while (1)
    {
        vTaskDelay(1);

        if(m_data_ready)
        {
            err_code = lis2dh12_data_read(&m_lis2dh12, NULL, m_accel_data, ACCEl_BUFFER_SIZE);
            APP_ERROR_CHECK(err_code);
            acceleration_to_velocity(m_accel_data, &m_velocity, ACCEl_BUFFER_SIZE);

